# 라이브러리 익숙해지기
'''
라이브러리에 대해 더 자세히 알고 스스로 쓸 줄 알게 만들기

큰 뼈대가 있는데 전에 했던걸 예시로 들자면  
출력하는 날짜나 수학 같은 경우 변수에 저장해서 바로 출력할 수 있다 하지만 
바로 어제 했던 이미지 같은 경우 내가 설정하려면 열어줘야한다 Image.open() 이런식으로 코드로 열어준 후 .save로 저장 후 코드를 끝내며 중간에 내가 열었던 파일을 설정하는 흐름이다

각각 라이브러리마다 쓰는법과 사용하는법 이름 특히 외부라이브러리 같은경우 직접 다운을 받아야하기에 모두 외울 필요는 없다 
표준라이브러리같은 경우 많이 쓰다보면 알아서 외워지기에 급하게 할 필요는 없고 
외부라이브러리 같은 경우 내가 만들고 싶은 프로젝트가 생겼을때 그때 기능을 배우는 느낌으로 웹 사이트의 데이터를 긁어오고 싶다면 BeautifulSoup이나 Requests를 찾아서 공부하고 이미지를 조작하고 싶다면 오늘 본 Pillow를 꺼내 쓰면 됩니다

이렇게 있다는것을 인지하고 쓸 수 있으면 된다 
실제 개발자들도 모두 외우진 않는다고 한다 많이 하다보니 외워졌다고 말했다

라이브러리 연습용으로 좋은 코드들을 직접 써보며 친해져야된다
'''
import random

menus = ["김밥", "라면", "돈까스", "떡볶이"]
today_menu = random.choice(menus)
print(today_menu)
# 랜덤 : 주로 무작위로 고를때 사용한다

#-----------------------------------------------------------------------------------

import datetime

now = datetime.datetime.now()
print(f"현재 시각: {now.strftime('%Y-%m-%d %H:%M:%S')}")
# 날짜, 시간 : 현재 날짜와 시간을 가져오거나 시간 계산을 할 때 사용한다

#-----------------------------------------------------------------------------------

import os

print(os.listdir("."))
# 현재 폴더(code123)에 있는 파일 목록 보기
# 내 컴퓨터의 폴더 안을 들여다보거나 파일을 찾고 이름을 바꿀 때 쓴다
# 어제배운 pillow 라이브러리와 조합해서 써서 폴더안 수십장의 사진들의 설정을 건들때 사용하면 좋다

#-----------------------------------------------------------------------------------

import math

print(math.sqrt(16)) # 제곱근 - 루트를 구하는 코드
print(math.ceil(3.14)) # 올림 - 소수점이 있으면 무조건 올려 정수를 만드는 코드 
print(math.floor(3.99)) # 내림 - 소수점이 있으면 무조건 내려 정수를 만드는 코드
print(math.pow(2, 3))  # 거듭제곱 - 2의 3제곱 = 8 ( 2 X 2 X 2 )

# 자바에서 수학계산이 필요할 때면 공식을 직접 짜야했지만 여기선 함수이름만 쓰면 되기에 편하다

#----------------------------------------------------------------------------------


# 각각 쓰는 명령어, 라이브러리의 이름, 쓰는법 모두가 다르기에 익숙해질때 까지 많이 써보며 익숙해지는것이 가장 좋다

